app/Controllers/Front/AuthClientController.php

INSERT INTO `solde` (`id_numero_tel`, `montant`, `date`) VALUES (6, 0, '2026-07-20 08:22:38')
---

                // Solde initial à 0
                $soldeModel = new SoldeModel();
                $soldeModel->insert([
                    'id_numero_tel' => $idNouveauNumero,
                    'montant'       => 0.0,
                    'date'          => date('Y-m-d H:i:s'),
                ]);