app/Controllers/Front/OperationController.php

    public function operation()
    {
        $typeModel = new TypeOperationModel();
        $soldeModel = new SoldeModel();

        $data['types']        = $typeModel->findAll();
---
SELECT *
FROM `type_operation`

    public function historique()
    {
        $idNumero = session()->get('numero_id');
        $model = new OperationModel();

        $type       = $this->request->getGet('type') ?: null;
        $montantMin = $this->request->getGet('montant_min') !== null && $this->request->getGet('montant_min') !== '' ? (float) $this->request->getGet('montant_min') : null;
        $montantMax = $this->request->getGet('montant_max') !== null && $this->request->getGet('montant_max') !== '' ? (float) $this->request->getGet('montant_max') : null;
        $dateDebut  = $this->request->getGet('date_debut') ?: null;
        $dateFin    = $this->request->getGet('date_fin') ?: null;

        // Si aucun filtre n'est appliqué, on affiche tout l'historique
        if (!$type && $montantMin === null && $montantMax === null && !$dateDebut && !$dateFin) {
            $data['operations'] = $model->historiquePourNumero($idNumero);
        } else {
            $data['operations'] = $model->historiqueFiltre($idNumero, $type, $montantMin, $montantMax, $dateDebut, $dateFin);
        }

        $data['monId']      = $idNumero;
        $data['types']      = (new TypeOperationModel())->findAll();
---
SELECT *
FROM `type_operation`