app/Controllers/Admin/CompteController.php

SELECT `nt`.`id`, `nt`.`numero`, `po`.`nom` as `operateur`, `s`.`montant` as `solde_actuel`, `s`.`date` as `date_solde`
FROM `numero_telephone` `nt`
JOIN `prefixe_operateur` `po` ON `po`.`id` = `nt`.`id_prefixe`
LEFT JOIN `solde` `s` ON `s`.`id` = (SELECT id FROM solde WHERE id_numero_tel = nt.id ORDER BY id DESC LIMIT 1)
WHERE   (
`nt`.`numero` LIKE '%airtel%' ESCAPE '!'
OR  `po`.`nom` LIKE '%airtel%' ESCAPE '!'
 )
ORDER BY `nt`.`id` ASC
---
    public function index()
    {
        $model = new NumeroTelephoneModel();
        $recherche = $this->request->getGet('q') ?: null;

        $builder = $model->db->table('numero_telephone nt')
            ->select('nt.id, nt.numero, po.nom as operateur, s.montant as solde_actuel, s.date as date_solde')
            ->join('prefixe_operateur po', 'po.id = nt.id_prefixe')
            ->join('solde s', 's.id = (SELECT id FROM solde WHERE id_numero_tel = nt.id ORDER BY id DESC LIMIT 1)', 'left');
        if ($recherche) {
            $builder->groupStart()
                ->like('nt.numero', $recherche)
                ->orLike('po.nom', $recherche)
            ->groupEnd();
        }
        $data['comptes'] = $builder->orderBy('nt.id', 'ASC')->get()->getResultArray();

SELECT *
FROM `numero_telephone`
WHERE `numero_telephone`.`id` = 1
---
    public function afficher(int $id)
    {
        $numeroModel = new NumeroTelephoneModel();
        $soldeModel = new SoldeModel();
        $operationModel = new OperationModel();

        $data['compte'] = $numeroModel->find($id);