app/Controllers/Admin/Entites.php

SELECT *
FROM `produits`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `produits`
---
    public function index()
    {
        $keyword   = $this->request->getGet('q');
        $categorie = $this->request->getGet('categorie');

        $data['produits']  = $this->model->rechercheEtFiltre($keyword, $categorie)->paginate(10, 'produits');