app/Controllers/Admin/OperateurController.php

SELECT *
FROM `operateur`
---
    public function index()
    {
        $data['operateurs'] = $this->operateurModel->findAll();

UPDATE `operateur` SET `nom` = 'Yas', `est_notre_operateur` = 0, `commission_exterieur` = 0
WHERE `operateur`.`id` IN ('1')
---
    public function mettreAJour($id)
    {
        $this->operateurModel->update($id, [
            'nom' => $this->request->getPost('nom'),
            'est_notre_operateur' => 0, // Force external operator
            'commission_exterieur' => ($this->request->getPost('commission_exterieur') ?? 0) / 100,
        ]);