app/Controllers/Admin/PrefixeController.php

SELECT `prefixe_operateur`.*, `operateur`.`nom` as `operateur_nom`
FROM `prefixe_operateur`
LEFT JOIN `operateur` ON `operateur`.`id` = `prefixe_operateur`.`id_operateur`
ORDER BY `prefixe_operateur`.`id` ASC
---
    public function index()
    {
        $model = new PrefixeOperateurModel();
        $recherche = $this->request->getGet('q') ?: null;

        $builder = $model->builder()
            ->select('prefixe_operateur.*, operateur.nom as operateur_nom')
            ->join('operateur', 'operateur.id = prefixe_operateur.id_operateur', 'left');

        if ($recherche) {
            $builder->groupStart()
                ->like('prefixe', $recherche)
            ->groupEnd();
        }
        $data['prefixes'] = $builder->orderBy('prefixe_operateur.id', 'ASC')->get()->getResultArray();

SELECT *
FROM `operateur`
---
    public function nouveau()
    {
        $data['title'] = 'Ajouter un préfixe';
        $data['operateurs'] = (new OperateurModel())->findAll();