app/Controllers/Admin/RapportController.php

SELECT strftime('%m', o.date) as mois, SUM(o.frais) as total_frais, COUNT(*) as nb_operations
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
WHERE strftime('%Y', o.date) = '2026'
GROUP BY `mois`
ORDER BY `mois` ASC
---
    public function gainsParMois()
    {
        $annee = $this->request->getGet('annee') ?: date('Y');
        $model = new OperationModel();

        $resultats = $model->db->table('operation o')
            ->select("strftime('%m', o.date) as mois, SUM(o.frais) as total_frais, COUNT(*) as nb_operations")
            ->join('type_operation t', 't.id = o.id_type_operation')
            ->where("strftime('%Y', o.date)", $annee)
            ->groupBy('mois')
            ->orderBy('mois', 'ASC')
            ->get()->getResultArray();