app/Controllers/Admin/Stats.php

    public function index()
    {
        $db = \Config\Database::connect();

        $parCategorie = $db->table('produits')
            ->select('categorie, COUNT(*) as total, SUM(stock) as stock_total')
            ->groupBy('categorie')
            ->get()
            ->getResultArray();

        $totalProduits = $db->table('produits')->countAllResults();
        $totalStock    = $db->table('produits')->selectSum('stock')->get()->getRow('stock');
        $prixMoyen     = $db->table('produits')->selectAvg('prix')->get()->getRow('prix');
---
SELECT `categorie`, COUNT(*) as total, SUM(stock) as stock_total
FROM `produits`
GROUP BY `categorie`
SELECT COUNT(*) AS `numrows`
FROM `produits`
SELECT SUM(`stock`) AS `stock`
FROM `produits`
SELECT AVG(`prix`) AS `prix`
FROM `produits`