app/Controllers/Admin/TrancheFraisController.php

    public function index()
    {
        $model = new TranchesFraisModel();
        $idType = $this->request->getGet('type') ?: null;

        $builder = $model->db->table('tranches_frais tf')
            ->select('tf.*, t.nom as type_nom')
            ->join('type_operation t', 't.id = tf.id_type_operation');
        if ($idType) {
            $builder->where('tf.id_type_operation', $idType);
        }
        $data['tranches'] = $builder->orderBy('tf.id_type_operation', 'ASC')->orderBy('tf.montant_min', 'ASC')->get()->getResultArray();
        $data['types'] = (new TypeOperationModel())->findAll();
---
SELECT `tf`.*, `t`.`nom` as `type_nom`
FROM `tranches_frais` `tf`
JOIN `type_operation` `t` ON `t`.`id` = `tf`.`id_type_operation`
WHERE `tf`.`id_type_operation` = '1'
ORDER BY `tf`.`id_type_operation` ASC, `tf`.`montant_min` ASC
SELECT *
FROM `type_operation`