app/Controllers/Admin/TypeOperationController.php

SELECT *
FROM `type_operation`
ORDER BY `id` ASC
---
    public function index()
    {
        $model = new TypeOperationModel();
        $data['types'] = $model->findAll();