app/Models/NumeroTelephoneModel.php

SELECT *
FROM `numero_telephone`
WHERE `numero` = '0343532131'
 LIMIT 1
---
    public function trouverParNumero(string $numero): ?array
    {
        return $this->where('numero', $numero)->first();

INSERT INTO `numero_telephone` (`id_prefixe`, `numero`, `date_creation`) VALUES (3, '0343532131', '2026-07-20 13:50:15')
---
    public function creerCompte(int $idPrefixe, string $numero): int
    {
        $this->insert([
            'id_prefixe'    => $idPrefixe,
            'numero'        => $numero,
            'date_creation' => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `prefixe_operateur`
WHERE `prefixe_operateur`.`id` = 3
SELECT *
FROM `operateur`
WHERE `operateur`.`id` = 1
---
    public function operateurDuNumero(string $numero): ?array
    {
        $numeroData = $this->trouverParNumero($numero);
        if (!$numeroData) return null;

        $prefixe = (new PrefixeOperateurModel())->find($numeroData['id_prefixe']);
        if (!$prefixe) return null;

        return (new OperateurModel())->find($prefixe['id_operateur']);