app/Models/OperationModel.php

    public function historiquePourNumero(int $idNumero): array
    {
        return $this->db->table('operation o')
            ->select('o.*, t.nom as type_nom, nd.numero as numero_dest, ne.numero as numero_exp')
            ->join('type_operation t', 't.id = o.id_type_operation')
            ->join('numero_telephone nd', 'nd.id = o.id_numero_tel_dest', 'left')
            ->join('numero_telephone ne', 'ne.id = o.id_numero_tel', 'left')
            ->groupStart()
                ->where('o.id_numero_tel', $idNumero)
                ->orWhere('o.id_numero_tel_dest', $idNumero)
            ->groupEnd()
            ->orderBy('o.date', 'DESC')
            ->get()->getResultArray();
---
SELECT `o`.*, `t`.`nom` as `type_nom`, `nd`.`numero` as `numero_dest`, `ne`.`numero` as `numero_exp`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
LEFT JOIN `numero_telephone` `nd` ON `nd`.`id` = `o`.`id_numero_tel_dest`
LEFT JOIN `numero_telephone` `ne` ON `ne`.`id` = `o`.`id_numero_tel`
WHERE   (
`o`.`id_numero_tel` = 1
OR `o`.`id_numero_tel_dest` = 1
 )
ORDER BY `o`.`date` DESC