app/Models/OperationModel.php

    public function montantsAEnvoyerParOperateur(): array
    {
        return $this->db->table('operation o')
            ->select('op.nom, SUM(o.montant + o.commission) as total_a_envoyer')
            ->join('numero_telephone nt_dest', 'nt_dest.id = o.id_numero_tel_dest')
            ->join('prefixe_operateur po', 'po.id = nt_dest.id_prefixe')
            ->join('operateur op', 'op.id = po.id_operateur')
            ->where('op.est_notre_operateur', 0)
            ->groupBy('op.nom')
            ->get()->getResultArray();
---
SELECT `op`.`nom`, SUM(o.montant + o.commission) as total_a_envoyer
FROM `operation` `o`
JOIN `numero_telephone` `nt_dest` ON `nt_dest`.`id` = `o`.`id_numero_tel_dest`
JOIN `prefixe_operateur` `po` ON `po`.`id` = `nt_dest`.`id_prefixe`
JOIN `operateur` `op` ON `op`.`id` = `po`.`id_operateur`
WHERE `op`.`est_notre_operateur` = 0
GROUP BY `op`.`nom`

    public function historiquePourNumero(int $idNumero): array
    {
        return $this->db->table('operation o')
            ->select('o.*, t.nom as type_nom, nd.numero as numero_dest, ne.numero as numero_exp')
            ->join('type_operation t', 't.id = o.id_type_operation')
            ->join('numero_telephone nd', 'nd.id = o.id_numero_tel_dest', 'left')
            ->join('numero_telephone ne', 'ne.id = o.id_numero_tel', 'left')
            ->groupStart()
                ->where('o.id_numero_tel', $idNumero)
                ->orWhere('o.id_numero_tel_dest', $idNumero)
            ->groupEnd()
            ->orderBy('o.date', 'DESC')
            ->get()->getResultArray();
---
SELECT `o`.*, `t`.`nom` as `type_nom`, `nd`.`numero` as `numero_dest`, `ne`.`numero` as `numero_exp`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
LEFT JOIN `numero_telephone` `nd` ON `nd`.`id` = `o`.`id_numero_tel_dest`
LEFT JOIN `numero_telephone` `ne` ON `ne`.`id` = `o`.`id_numero_tel`
WHERE   (
`o`.`id_numero_tel` = 2
OR `o`.`id_numero_tel_dest` = 2
 )
ORDER BY `o`.`date` DESC

    public function historiqueFiltre(int $idNumero, ?string $type = null, ?float $montantMin = null, ?float $montantMax = null, ?string $dateDebut = null, ?string $dateFin = null): array
    {
        $builder = $this->db->table('operation o')
            ->select('o.*, t.nom as type_nom, nd.numero as numero_dest, ne.numero as numero_exp')
            ->join('type_operation t', 't.id = o.id_type_operation')
            ->join('numero_telephone nd', 'nd.id = o.id_numero_tel_dest', 'left')
            ->join('numero_telephone ne', 'ne.id = o.id_numero_tel', 'left')
            ->groupStart()
                ->where('o.id_numero_tel', $idNumero)
                ->orWhere('o.id_numero_tel_dest', $idNumero)
            ->groupEnd();

        if ($type) {
            $builder->where('t.nom', $type);
        }
        if ($montantMin !== null) {
            $builder->where('o.montant >=', $montantMin);
        }
        if ($montantMax !== null) {
            $builder->where('o.montant <=', $montantMax);
        }
        if ($dateDebut) {
            $builder->where('o.date >=', $dateDebut . ' 00:00:00');
        }
        if ($dateFin) {
            $builder->where('o.date <=', $dateFin . ' 23:59:59');
        }

        return $builder->orderBy('o.date', 'DESC')->get()->getResultArray();
---
SELECT `o`.*, `t`.`nom` as `type_nom`, `nd`.`numero` as `numero_dest`, `ne`.`numero` as `numero_exp`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
LEFT JOIN `numero_telephone` `nd` ON `nd`.`id` = `o`.`id_numero_tel_dest`
LEFT JOIN `numero_telephone` `ne` ON `ne`.`id` = `o`.`id_numero_tel`
WHERE   (
`o`.`id_numero_tel` = 5
OR `o`.`id_numero_tel_dest` = 5
 )
ORDER BY `o`.`date` DESC