app/Models/PrefixeOperateurModel.php

SELECT *
FROM `prefixe_operateur`
WHERE `prefixe` = '034'
 LIMIT 1
---
    public function findByPrefixe(string $prefixe): ?array
    {
        return $this->where('prefixe', $prefixe)->first();