app/Models/SoldeModel.php

    public function dernierSolde(int $idNumeroTel): ?array
    {
        return $this->where('id_numero_tel', $idNumeroTel)
                    ->orderBy('id', 'DESC')
                    ->first();
---
SELECT *
FROM `solde`
WHERE `id_numero_tel` = 9
ORDER BY `id` DESC
 LIMIT 1

    public function insertNouveauSolde(int $idNumeroTel, float $delta): void
    {
        $ancien = $this->dernierSolde($idNumeroTel);
        $ancienMontant = $ancien ? (float) $ancien['montant'] : 0.0;
        $this->insert([
            'id_numero_tel' => $idNumeroTel,
            'montant'       => $ancienMontant + $delta,
            'date'          => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `solde` (`id_numero_tel`, `montant`, `date`) VALUES (9, 0, '2026-07-20 13:50:15')