app/Models/TranchesFraisModel.php

    public function parType(int $idTypeOperation): array
    {
        return $this->where('id_type_operation', $idTypeOperation)
                    ->orderBy('montant_min', 'ASC')
                    ->findAll();
---
SELECT *
FROM `tranches_frais`
WHERE `id_type_operation` = 2
ORDER BY `montant_min` ASC